Ran Plan for dir: `infrastructure/gcp/cloud-deployment/gkubernetes-engine-ols` workspace: `default`

<details><summary>Show Output</summary>

```diff
data.terraform_remote_state.vpc_ols_network: Reading...
data.terraform_remote_state.vpc_ols_network: Read complete after 0s
data.google_service_account.gcompute_engine_default_service_account: Reading...
data.google_service_account.gcompute_engine_default_service_account: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.gkubernetes_engine.google_container_cluster.cluster will be created
+ resource "google_container_cluster" "cluster" {
      + cluster_ipv4_cidr           = (known after apply)
      + datapath_provider           = (known after apply)
      + default_max_pods_per_node   = (known after apply)
      + enable_binary_authorization = false
      + enable_intranode_visibility = (known after apply)
      + enable_kubernetes_alpha     = false
      + enable_l4_ilb_subsetting    = false
      + enable_legacy_abac          = false
      + enable_shielded_nodes       = true
      + endpoint                    = (known after apply)
      + id                          = (known after apply)
      + initial_node_count          = 1
      + label_fingerprint           = (known after apply)
      + location                    = "asia-southeast2-a"
      + logging_service             = (known after apply)
      + master_version              = (known after apply)
      + monitoring_service          = (known after apply)
      + name                        = "ols-dev-gkubernetes-engine-cluster"
      + network                     = "https://www.googleapis.com/compute/v1/projects/onlineshop-378118/global/networks/ols-dev-vpc-network"
      + networking_mode             = (known after apply)
      + node_locations              = (known after apply)
      + node_version                = (known after apply)
      + operation                   = (known after apply)
      + private_ipv6_google_access  = (known after apply)
      + project                     = (known after apply)
      + remove_default_node_pool    = true
      + resource_labels             = {
          + "business_unit" = "ols"
          + "code"          = "gkubernetes-engine"
          + "environment"   = "dev"
          + "feature"       = "cluster"
        }
      + self_link                   = (known after apply)
      + services_ipv4_cidr          = (known after apply)
      + subnetwork                  = "https://www.googleapis.com/compute/v1/projects/onlineshop-378118/regions/asia-southeast2/subnetworks/ols-dev-vpc-subnet-asia-southeast2"
      + tpu_ipv4_cidr_block         = (known after apply)

      + binary_authorization {
          + evaluation_mode = "PROJECT_SINGLETON_POLICY_ENFORCE"
        }

      + cluster_autoscaling {
          + enabled = false
        }

      + dns_config {
          + cluster_dns        = "CLOUD_DNS"
          + cluster_dns_domain = "blast.local"
          + cluster_dns_scope  = "VPC_SCOPE"
        }

      + ip_allocation_policy {
          + cluster_ipv4_cidr_block       = (known after apply)
          + cluster_secondary_range_name  = "pods-range"
          + services_ipv4_cidr_block      = (known after apply)
          + services_secondary_range_name = "services-range"
          + stack_type                    = "IPV4"
        }

      + master_auth {
          + client_certificate     = (known after apply)
          + client_key             = (sensitive value)
          + cluster_ca_certificate = (known after apply)

          + client_certificate_config {
              + issue_client_certificate = true
            }
        }

      + master_authorized_networks_config {
          + gcp_public_cidrs_access_enabled = true

          + cidr_blocks {
              + cidr_block   = "182.253.194.32/28"
              + display_name = "my-home-public-ip"
            }
        }

      + network_policy {
          + enabled  = true
          + provider = "CALICO"
        }

      + private_cluster_config {
          + enable_private_nodes   = true
          + master_ipv4_cidr_block = "192.168.0.0/28"
          + peering_name           = (known after apply)
          + private_endpoint       = (known after apply)
          + public_endpoint        = (known after apply)
        }
    }

  # module.gkubernetes_engine.google_container_node_pool.nodepool["spot"] will be created
+ resource "google_container_node_pool" "nodepool" {
      + cluster                     = "ols-dev-gkubernetes-engine-cluster"
      + id                          = (known after apply)
      + initial_node_count          = (known after apply)
      + instance_group_urls         = (known after apply)
      + location                    = "asia-southeast2-a"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "spot"
      + name_prefix                 = (known after apply)
      + node_count                  = 2
      + node_locations              = (known after apply)
      + operation                   = (known after apply)
      + project                     = (known after apply)
      + version                     = (known after apply)

      + autoscaling {
          + location_policy = "ANY"
          + max_node_count  = 20
          + min_node_count  = 2
        }

      + node_config {
          + disk_size_gb      = 20
          + disk_type         = "pd-standard"
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = {
              + "business_unit" = "ols"
              + "code"          = "gkubernetes-engine"
              + "environment"   = "dev"
              + "feature"       = "cluster"
              + "name"          = "ols-dev-gkubernetes-engine-cluster-nodepool-spot"
              + "type"          = "spot"
            }
          + local_ssd_count   = (known after apply)
          + logging_variant   = "DEFAULT"
          + machine_type      = "e2-medium"
          + metadata          = (known after apply)
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
          + preemptible       = false
          + service_account   = (known after apply)
          + spot              = false
          + tags              = [
              + "spot",
            ]
          + taint             = (known after apply)

          + shielded_instance_config {
              + enable_integrity_monitoring = false
              + enable_secure_boot          = true
            }
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ cluster_ca_certificate     = (known after apply)
+ cluster_client_certificate = (known after apply)
+ cluster_client_key         = (sensitive value)
+ cluster_endpoint           = (known after apply)
+ cluster_id                 = (known after apply)
+ cluster_master_version     = (known after apply)
+ cluster_self_link          = (known after apply)
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d infrastructure/gcp/cloud-deployment/gkubernetes-engine-ols`
* :put_litter_in_its_place: To **delete** this plan click [here](http://ols-dev-gce-atlantis:4141/lock?id=greyhats13%252Fol_shop%252Finfrastructure%252Fgcp%252Fcloud-deployment%252Fgkubernetes-engine-ols%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d infrastructure/gcp/cloud-deployment/gkubernetes-engine-ols`
</details>
Plan: 2 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`